Repository: nh36/ChinTransMem
Catalog: corpus/exports/tmx/mozi__mozi-005-the-seven-worries__aligned_passages.tmx
Source language: zh_hant
Languages: en

source: 子墨子曰：國有七患。七患者何？城郭溝池不可守，而治宮室，一患也。邊國至境，四鄰莫救，二患也。先盡民力無用之功，賞賜無能之人，民力盡於無用，財寶虛於待客，三患也。
en: Motse said: There are seven causes of worry to a state and they are: (1) When the outer and the inner city walls are not defensible; (2) When an enemy state is approaching and yet one’s neighbours do not come to the rescue; (3) When the resources of the people have all been spent on useless enterprises and gifts all squandered upon incapable men, when people’s resources are exhausted without producing any profit and the treasury is emptied by entertaining idle company; (4) When the officials value only their salaries, and the sophists only friendship, and when the subordinates dare not remonstrate against the laws the ruler has made for persecution; (5) When the lord is over-confident of his own wisdom and holds no consultation, when he feels he is secure and makes no preparations against attack, and when he does not know that he must be watchful while neighbours are planning against him; (6) When those trusted are not loyal and the loyal are not trusted; and (7) When the crops are not sufficient for food and the ministers can not be charged with responsibihties, and when awards fail to make people happy and punishment to make them afraid.

source: 仕者持祿，游者愛佼，君修法討臣，臣懾而不敢拂，四患也。君自以爲聖智而不問事，自以爲安彊而無守備，四鄰謀之不知戒，五患也。
en: With these seven causes present in the maintenance of the state, the of wisdom, including the art of rhetoric and statecraft, but degenerated into jugglers of words or even worse, Cf.

source: 所信者不忠，所忠者不信，六患也。畜種菽粟不足以食之，大臣不足以事之。賞賜不能喜，誅罰不能威，七患也。以七患居國，必無社稷。以七患守城，敵至國傾。
en: c State will perish, and, in the defence of a city, the city will be reduced to ruin by the approaching enemy. Where-ever these seven causes are found, the country will face calamity. Now, the five grains are the people's mainstay and the source of the ruler’s revenue.

source: 七患之所當，國必有殃。凡五穀者，民之所仰也，君之所以爲養也。故民無仰則君無養，民無食則不可事。故食不可不務也，地不可不力也，用不可不節也。五穀盡收則五味盡御於主，不盡收則不盡御。一谷不收謂之饉，二谷不收謂之旱，三谷不收謂之凶，四谷不收謂之餽，五穀不收謂之饑。
en: When the people lose their support the ruler cannot have any revenue either. And without food the people will not observe order. Therefore, food should be secured, land cultivated and espenditures cut down. ■\Tien all the five grains are gathered, all the five tastes 2 will be offered the ruler; when not all gathered, the five tastes will not be all offered. Failure of one grain is called dearth; failure of two grains is called scarcity; failure of three grains is called cakmity m I failure of four grains is called want; and failure of all five grains is called famine When the country is in dearth, all the salaries of the officials below the rank of the minister will be reduced by one-fifth; in scarcity, they will be reduced by two-fifths; in calamity, they will be reduced by three-fifths; in want, they will be reduced by four-fifths; and when famine is in the country there will be no salaries beyond their rations. Therefore when famine and dearth visit a country, the ruler will omit three from the five items of sacrifice, the officials will suspend the courts, and the scholars will not go to school and the lord will not put on his robe to give audience.

source: 歲饉，則仕者大夫以下皆損祿五分之一。旱，則損五分之二。
en: Even envoys from other (3) millet of a different variety, (4) wheat, and (5) soy beans.

source: 凶，則損五分之三。餽，則損五分之四。
en: tast include bitter, hot, sour, sweet, and salty.

source: 饑，則盡無祿，稟食而已矣。故凶饑存乎國，人君徹鼎食五分之五，大夫徹縣，士不入學，君朝之衣不革制，諸侯之客，四鄰之使，雍食而不盛，徹驂騑，塗不芸，馬不食粟，婢妾不衣帛，此告不足之至也。
en: But openly it is used figuratively, signifying elaborate cooking and sumptuous feudal lords and messengers from, neighbouring states are entertained with cooked food only, and it is not sumptuous. The side-horses of the carriage-team are done awaj with and the walks (in the palace) are not weeded. Neither are the horses fed with grains, nor are the concubines and maids clothed with silk. And this is the sign of extreme scarcity-Now, if carrying her child and drawing water from a well, a woman dropped the child into the well, she would of course endeavour to get it out.

source: 今有負其子而汲者，隊其子於井中，其母必從而道之。
en: But famine and dearth is a much greater calamity than the dropping of a child.

source: 今歲凶、民饑、道餓，重其子此疚於隊，其可無察邪？故時年歲善，則民仁且良；時年歲凶，則民吝且惡。夫民何常此之有？爲者疾，食者衆，則歲無豐。故曰：
en: Should there not be also endeavour (to prevent it)? People are gentle and kind when the year is good, but selfish and vicious when it is bad. Yet, how can they be held responsible? When many produce but few consume then there can be no bad year; on the contrary, when few produce but many consume then there can be no good year. Thus it is said: scarcity of supply should stimulate study of the seasons and want of food demands economy of expenditures. The ancients produced wealth according to seasons.

source: 「財不足則反之時，食不足則反之用。」故先民以時生財，固本而用財，則財足。故雖上世之聖王，豈能使五穀常收，而旱水不至哉！然而無凍餓之民者，何也？
en: They ascertained the source of wealth before they appropriated the products, and therefore they had plenty. Could even the ancient sage-kings cause the five grains invariably to ripen and be harvested and the floods and the droughts never to occur? Yet, none were frozen or starved, why was it?

source: 其力時急，而自養儉也。故《夏書》曰「禹七年水。」《殷書》曰「湯五年旱。」此其離凶餓甚矣。
en: It was because they made full use of the seasons and were frugal in their own maintenance.

source: 然而民不凍餓者，何也？其生財密，其用之節也。故倉無備粟，不可以待凶饑；庫無備兵，雖有義不能征無義。城郭不備全，不可以自守。心無備慮，不可以應卒。
en: The history of Hsia says that the Deluge lasted seven years in the time of Yli and the history of Yin tells that a drought visited so? The reason lies in diligent production and thrifty consumption. Therefore, famine and dearth cannot be prepared against unless there are stored grains in the granaries, and justice cannot be maintained against the unjust unless there are ready weapons in the armoury.

source: 是若慶忌無去之心，不能輕出。夫桀無待湯之備，故放。紂無待武王之備，故殺。桀、紂貴爲天子，富有天下。
en: One cannot defend himself unless the inner and the outer city walls are in repair, and one cannot meet emergencies unless his ideas are well’ thought out. Thus Ch’ing Chi i was unprepared, and he should not have set out on the journey.

source: 然而皆滅亡於百里之君者，何也？有富貴而不爲備也。
en: Chieh made no preparations against T’ang and he was sent to exile.

source: 故備者國之重也。食者國之寶也，兵者國之爪也，城者所以自守也，此三者國之具也。故曰：
en: And Chow made to reward the undeserving, empty the treasury to acquire callages and horses, exhaust the labourers to build palaces and furmsh amusements.

source: 以其極賞，以賜無功，虛其府庫，以備車馬衣裘奇怪。苦其役徒，以治宮室觀樂。
en: Upon their death, again, thick coffins and many coats and fur coats are to be furnished. it 1 » A U B i.

source: 死又厚爲棺槨，多爲衣裘。
en: to and was murdered on the wav.

source: 生時治臺榭，死又脩墳墓。
en: A 11 IS equal to approximately J mile.

source: 故民苦於外，府庫單於內。上不厭其樂，下不堪其苦。故國離寇敵則傷，民見凶饑則亡，此皆備不具之罪也。
en: Porciies and pavilions are built for them while they are living, and tombs when they are dead. By this the people are embittered and the treasury is left lean.

source: 且夫食者，聖人之所寶也。故《周書》曰：「國無三年之食者，國非其國也；家無三年之食者，子非其子也。」此之謂國備。
en: While the amusements are not yet satisfying to the superiors, the hardship already becomes unbearable for the subjects. Such a state will fall under any attack and such people will perish by famine. And all this is due to the absence of preparation. Moreover, food is what the sages treasured. The history of Chou says; Without three years’ food (in store) a state cannot be a state (as it is in danger of losing its sovereignty). A family being without food in store to be suiB&cient for three years its children cannot be its children (who are in danger of being abandoned or sold to others)." Such, then, is the preparation of a country.
